       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDING-INTEREST.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BL-RES PIC 9(09)V99.
       01 ACTUAL-BALANCE PIC 9(09)V99.
       01 ACTUAL-INTEREST PIC 9(03)V9(6).

       COPY "INTS.cpy".

       PROCEDURE DIVISION.
           ACCEPT ENTRY-POINT FROM ARGUMENT-VALUE.
           MOVE ENT-ACTUAL-BALANCE TO ACTUAL-BALANCE.
           MOVE ENT-CURRENT-INTEREST TO ACTUAL-INTEREST.

           COMPUTE BL-RES ROUNDED = ACTUAL-BALANCE * 
           (1 + ACTUAL-INTEREST).

           DISPLAY BL-RES.

           GOBACK.

       