       IDENTIFICATION DIVISION.
           PROGRAM-ID. ADDING-BALANCE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       01 BAL-RES    PIC 9(09)V99.
       01 ACTUAL-BALANCE    PIC 9(09)V99.
       01 QUANTITY-TO-MODIFY    PIC 9(09)V99.

       COPY "BLUP.cpy".

       PROCEDURE DIVISION.
           ACCEPT ENTRY-POINT FROM ARGUMENT-VALUE.
           MOVE ENT-ACTUAL-BALANCE TO ACTUAL-BALANCE.
           MOVE ENT-QUANTITY-TO-MODIFY TO QUANTITY-TO-MODIFY.

           ADD ACTUAL-BALANCE TO QUANTITY-TO-MODIFY GIVING BAL-RES.

           DISPLAY BAL-RES.
      
           GOBACK.
