          IDENTIFICATION DIVISION. 
           PROGRAM-ID. MAIN.
          DATA DIVISION.
          WORKING-STORAGE SECTION.
          01 SALUDO PIC A(4) .
          PROCEDURE DIVISION.
           DISPLAY "SALUDO".
           ACCEPT SALUDO.
           DISPLAY SALUDO.
           STOP RUN.
              
              
      