       IDENTIFICATION DIVISION.
           PROGRAM-ID. SUBSTRACT-BALANCE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       01 BL-RES    PIC 9(09)V99.
       01 ACTUAL-BALANCE    PIC 9(09)V99.
       01 QUANTITY-TO-MODIFY    PIC 9(09)V99.

       COPY "BLUP.cpy".

       PROCEDURE DIVISION.
           ACCEPT ENTRY-POINT FROM ARGUMENT-VALUE.
           MOVE ENT-ACTUAL-BALANCE TO ACTUAL-BALANCE.
           MOVE ENT-QUANTITY-TO-MODIFY TO QUANTITY-TO-MODIFY.

           SUBTRACT ACTUAL-BALANCE FROM QUANTITY-TO-MODIFY GIVING BL-RES.

           DISPLAY BL-RES.
      
           GOBACK.